### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.apim.azurerm_api_management_api.send_api_v1 will be created
  + resource "azurerm_api_management_api" "send_api_v1" {
      + api_management_name   = "io-p-itn-platform-api-gateway-apim-01"
      + api_type              = (known after apply)
      + description           = "IO COM SEND AAR"
      + display_name          = "IO COM SEND AAR"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "io-p-itn-send-aar-api-01"
      + path                  = "api/com/v1/send/aar"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "io-p-itn-common-rg-01"
      + revision              = "1"
      + service_url           = (known after apply)
      + subscription_required = false
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi-link"
          + content_value  = "https://raw.githubusercontent.com/pagopa/io-messages/2b0d3d226b95f731c4a6fdf58daff2e6dfcb4ef0/apps/send-func/openapi/aar-notification.yaml"
        }

      + subscription_key_parameter_names (known after apply)
    }

  # module.apim.azurerm_api_management_api_policy.send_aar_api_v1_policy will be created
  + resource "azurerm_api_management_api_policy" "send_aar_api_v1_policy" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + api_name            = "io-p-itn-send-aar-api-01"
      + id                  = (known after apply)
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = (known after apply)
      + xml_link            = "https://raw.githubusercontent.com/pagopa/io-messages/2b0d3d226b95f731c4a6fdf58daff2e6dfcb4ef0/infra/resources/_modules/apim/api/send/policy.xml"
    }

  # module.apim.azurerm_api_management_policy_fragment.auth must be replaced
-/+ resource "azurerm_api_management_policy_fragment" "auth" {
      ~ api_management_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01" -> "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01" # forces replacement
      ~ id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/policyFragments/io-com-app-session-fragment" -> (known after apply)
        name              = "io-com-app-session-fragment"
      ~ value             = <<-EOT
          - <fragment>
          + <fragment>
          - 	<!-- Extract the token from the Authorization Header -->
          + 	<!-- Extract the token from the Authorization Header -->
          - 	<set-variable name="token" value="@{
          +   <set-variable name="token" value="@{
                string[] values;
                return context.Request.Headers.TryGetValue("Authorization", out values) ? values.FirstOrDefault() : "";
          -   }" />
          +   }" />
          - 	<!-- Check if the Authorization header is valid, if not return 401 Unauthorized -->
          +   <!-- Check if the Authorization header is valid, if not return 401 Unauthorized -->
          - 	<choose>
          +   <choose>
          - 		<when condition="@(
          +     <when condition="@(
                  string.IsNullOrEmpty((string)context.Variables["token"]) ||
                  !(((string)context.Variables["token"]).StartsWith("Bearer ", StringComparison.OrdinalIgnoreCase)) ||
                  string.IsNullOrWhiteSpace(((string)context.Variables["token"]).Substring(7))
          -     )">
          +     )">
          - 			<set-header name="Content-Type" exists-action="override">
          +       <set-header name="Content-Type" exists-action="override">
          - 				<value>application/json</value>
          +         <value>application/json</value>
          - 			</set-header>
          +       </set-header>
          - 			<return-response>
          +       <return-response>
          - 				<set-status code="401" reason="Unauthorized" />
          +         <set-status code="401" reason="Unauthorized" />
          - 				<set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
          +         <set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
          - 			</return-response>
          +       </return-response>
          - 		</when>
          +   </when>
          - 	</choose>
          +   </choose>
          - 	<!-- Call the session manager, pasing the bearer token, to get the user identity -->
          +   <!-- Call the session manager, pasing the bearer token, to get the user identity -->
          - 	<send-request mode="new" response-variable-name="introspectionResponse" timeout="10" ignore-error="false">
          + 	<send-request mode="new" response-variable-name="introspectionResponse" timeout="10" ignore-error="false">
          - 		<set-url>https://io-p-weu-session-manager-app-03.azurewebsites.net/api/auth/v1/user-identity</set-url>
          + 		<set-url>https://io-p-weu-session-manager-app-03.azurewebsites.net/api/auth/v1/user-identity</set-url>
          - 		<set-method>GET</set-method>
          + 		<set-method>GET</set-method>
          - 		<set-header name="Content-Type" exists-action="override">
          + 		<set-header name="Content-Type" exists-action="override">
          - 			<value>application/json</value>
          +       <value>application/json</value>
          - 		</set-header>
          + 		</set-header>
          - 		<set-header name="Authorization" exists-action="override">
          + 		<set-header name="Authorization" exists-action="override">
          - 			<value>@(((string)context.Variables["token"]))</value>
          +       <value>@(((string)context.Variables["token"]))</value>
          - 		</set-header>
          + 		</set-header>
          - 	</send-request>
          + 	</send-request>
          - 	<choose>
          + 	<choose>
          - 		<!-- If 200 return set the x-user header as the base64 of the response -->
          +     <!-- If 200 return set the x-user header as the base64 of the response -->
          - 		<when condition="@(((IResponse)context.Variables["introspectionResponse"]).StatusCode == 200)">
          + 		<when condition="@(((IResponse)context.Variables["introspectionResponse"]).StatusCode == 200)">
          - 			<!-- Parse the introspectionResponse as a string -->
          + 			<!-- Parse the introspectionResponse as a string -->
          - 			<set-variable name="userData" value="@(((IResponse)context.Variables["introspectionResponse"]).Body.As&lt;string&gt;())" />
          + 			<set-variable name="userData" value="@(((IResponse)context.Variables["introspectionResponse"]).Body.As&lt;string&gt;())" />
          - 			<!-- Remove the Authorization Header -->
          + 			<!-- Remove the Authorization Header -->
          - 			<set-header name="Authorization" exists-action="delete" />
          + 			<set-header name="Authorization" exists-action="delete" />
          - 			<!-- Set the x-user header with the user data -->
          + 			<!-- Set the x-user header with the user data -->
          - 			<set-header name="x-user" exists-action="override">
          + 			<set-header name="x-user" exists-action="override">
            				<value>@(
                      Convert.ToBase64String(
                          System.Text.Encoding.UTF8.GetBytes(((string)context.Variables["userData"]))
                      )
          -         )</value>
          +         )</value>
          - 			</set-header>
          + 			</set-header>
          - 		</when>
          + 		</when>
          - 		<when condition="@(((IResponse)context.Variables["introspectionResponse"]).StatusCode == 401)">
          + 		<when condition="@(((IResponse)context.Variables["introspectionResponse"]).StatusCode == 401)">
          - 			<return-response response-variable-name="introspectionErrorResponse">
          + 			<return-response response-variable-name="introspectionErrorResponse">
          - 				<set-status code="401" reason="Unauthorized" />
          + 				<set-status code="401" reason="Unauthorized" />
          - 				<set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
          +           <set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
          - 			</return-response>
          + 			</return-response>
          - 		</when>
          + 		</when>
          - 		<otherwise>
          + 		<otherwise>
          - 			<set-header name="Content-Type" exists-action="override">
          + 			<set-header name="Content-Type" exists-action="override">
          - 				<value>application/json</value>
          +         <value>application/json</value>
          - 			</set-header>
          + 			</set-header>
          - 			<return-response response-variable-name="introspectionErrorResponse">
          + 			<return-response response-variable-name="introspectionErrorResponse">
          - 				<set-status code="500" reason="Internal Server Error" />
          + 				<set-status code="500" reason="Internal Server Error" />
          - 				<set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
          +           <set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
          - 			</return-response>
          +         </return-response>
          - 		</otherwise>
          + 		</otherwise>
          - 	</choose>
          + 	</choose>
            </fragment>
        EOT
        # (2 unchanged attributes hidden)
    }

  # module.apim.azurerm_api_management_product.apim_itn_product_send_aar will be created
  + resource "azurerm_api_management_product" "apim_itn_product_send_aar" {
      + api_management_name   = "io-p-itn-platform-api-gateway-apim-01"
      + approval_required     = false
      + description           = "Product for IO SEND AAR API"
      + display_name          = "IO SEND AAR API"
      + id                    = (known after apply)
      + product_id            = "io-send-aar-api"
      + published             = true
      + resource_group_name   = "io-p-itn-common-rg-01"
      + subscription_required = true
    }

  # module.apim.azurerm_api_management_product_api.send_aar_api_v1_product_api will be created
  + resource "azurerm_api_management_product_api" "send_aar_api_v1_product_api" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + api_name            = "io-p-itn-send-aar-api-01"
      + id                  = (known after apply)
      + product_id          = "io-send-aar-api"
      + resource_group_name = "io-p-itn-common-rg-01"
    }

  # module.apim.azurerm_api_management_product_policy.apim_itn_product_send_policy will be created
  + resource "azurerm_api_management_product_policy" "apim_itn_product_send_policy" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + id                  = (known after apply)
      + product_id          = "io-send-aar-api"
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = (known after apply)
      + xml_link            = "https://raw.githubusercontent.com/pagopa/io-messages/2b0d3d226b95f731c4a6fdf58daff2e6dfcb4ef0/infra/resources/_modules/apim/product/policy.xml"
    }

  # module.web_apps.module.citizen_func_autoscaler_new.azurerm_monitor_autoscale_setting.this will be updated in-place
  ~ resource "azurerm_monitor_autoscale_setting" "this" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Insights/autoScaleSettings/io-p-itn-com-citizen-as-02"
        name                = "io-p-itn-com-citizen-as-02"
        tags                = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "ModuleName"     = "azure_app_service_plan_autoscaler"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "1.1.3"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (4 unchanged attributes hidden)

      ~ profile {
            name = "low_load_profile"

          ~ rule {
              ~ metric_trigger {
                  ~ statistic                = "Average" -> "Max"
                  ~ threshold                = 80 -> 50
                  ~ time_aggregation         = "Average" -> "Maximum"
                  ~ time_window              = "PT5M" -> "PT2M"
                    # (6 unchanged attributes hidden)
                }
              ~ scale_action {
                  ~ cooldown  = "PT1M" -> "PT3M"
                  ~ value     = 1 -> 3
                    # (2 unchanged attributes hidden)
                }
            }
          ~ rule {
              ~ metric_trigger {
                  ~ statistic                = "Average" -> "Max"
                  ~ time_aggregation         = "Average" -> "Maximum"
                    # (8 unchanged attributes hidden)
                }
              ~ scale_action {
                  ~ value     = 1 -> 3
                    # (3 unchanged attributes hidden)
                }
            }

            # (2 unchanged blocks hidden)
        }
      ~ profile {
            name = jsonencode(
                {
                    for  = "low_load_profile"
                    name = "default"
                }
            )

          ~ rule {
              ~ metric_trigger {
                  ~ statistic                = "Average" -> "Max"
                  ~ threshold                = 80 -> 50
                  ~ time_aggregation         = "Average" -> "Maximum"
                  ~ time_window              = "PT5M" -> "PT2M"
                    # (6 unchanged attributes hidden)
                }
              ~ scale_action {
                  ~ cooldown  = "PT1M" -> "PT3M"
                  ~ value     = 1 -> 3
                    # (2 unchanged attributes hidden)
                }
            }
          ~ rule {
              ~ metric_trigger {
                  ~ statistic                = "Average" -> "Max"
                  ~ time_aggregation         = "Average" -> "Maximum"
                    # (8 unchanged attributes hidden)
                }
              ~ scale_action {
                  ~ value     = 1 -> 3
                    # (3 unchanged attributes hidden)
                }
            }

            # (2 unchanged blocks hidden)
        }
    }

Plan: 6 to add, 1 to change, 1 to destroy.
```

</details>
